#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.nsg.azurerm_network_security_group.nsg["nsg-dev"] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "centralindia"
      + name                = "nsg-dev"
      + resource_group_name = "rg-dev-ci"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3389"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "allow-rdp"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "5985"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "allow-winrm"
              + priority                                   = 120
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "5986"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "allow-winrmsec"
              + priority                                   = 110
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
    }

  # module.nsgassoc.data.azurerm_network_security_group.nsgdata["dev-app-nsg-assoc"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "nsgdata" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "nsg-dev"
      + resource_group_name = "rg-dev-ci"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.nsgassoc.data.azurerm_network_security_group.nsgdata["dev-web-nsg-assoc"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_network_security_group" "nsgdata" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "nsg-dev"
      + resource_group_name = "rg-dev-ci"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.nsgassoc.data.azurerm_subnet.datasubnet["dev-app-nsg-assoc"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "datasubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-app"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-dev-ci"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-dev-ci"
    }

  # module.nsgassoc.data.azurerm_subnet.datasubnet["dev-web-nsg-assoc"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "datasubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-web"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-dev-ci"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-dev-ci"
    }

  # module.nsgassoc.azurerm_subnet_network_security_group_association.nsg_assoc["dev-app-nsg-assoc"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.nsgassoc.azurerm_subnet_network_security_group_association.nsg_assoc["dev-web-nsg-assoc"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.rgs.azurerm_resource_group.rg["rg-dev-ci"] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "centralindia"
      + name     = "rg-dev-ci"
    }

  # module.vms.data.azurerm_subnet.datasubnet["vm-dev-app-01"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "datasubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-app"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-dev-ci"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-dev-ci"
    }

  # module.vms.data.azurerm_subnet.datasubnet["vm-dev-web-01"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "datasubnet" {
      + address_prefix                                = (known after apply)
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = (known after apply)
      + id                                            = (known after apply)
      + name                                          = "snet-web"
      + network_security_group_id                     = (known after apply)
      + private_endpoint_network_policies             = (known after apply)
      + private_link_service_network_policies_enabled = (known after apply)
      + resource_group_name                           = "rg-dev-ci"
      + route_table_id                                = (known after apply)
      + service_endpoints                             = (known after apply)
      + virtual_network_name                          = "vnet-dev-ci"
    }

  # module.vms.azurerm_network_interface.nic["vm-dev-app-01"] will be created
  + resource "azurerm_network_interface" "nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "centralindia"
      + mac_address                    = (known after apply)
      + name                           = "vm-dev-app-01-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-dev-ci"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.vms.azurerm_network_interface.nic["vm-dev-web-01"] will be created
  + resource "azurerm_network_interface" "nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "centralindia"
      + mac_address                    = (known after apply)
      + name                           = "vm-dev-web-01-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-dev-ci"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.vms.azurerm_public_ip.public_ip["vm-dev-app-01"] will be created
  + resource "azurerm_public_ip" "public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralindia"
      + name                    = "vm-dev-app-01-pip"
      + resource_group_name     = "rg-dev-ci"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.vms.azurerm_public_ip.public_ip["vm-dev-web-01"] will be created
  + resource "azurerm_public_ip" "public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralindia"
      + name                    = "vm-dev-web-01-pip"
      + resource_group_name     = "rg-dev-ci"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.vms.azurerm_windows_virtual_machine.windows_vms["vm-dev-app-01"] will be created
  + resource "azurerm_windows_virtual_machine" "windows_vms" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = (known after apply)
      + automatic_updates_enabled                              = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = (known after apply)
      + id                                                     = (known after apply)
      + location                                               = "centralindia"
      + max_bid_price                                          = -1
      + name                                                   = "vm-dev-app-01"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-dev-ci"
      + size                                                   = "Standard_D2s_v3"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2016-Datacenter"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.vms.azurerm_windows_virtual_machine.windows_vms["vm-dev-web-01"] will be created
  + resource "azurerm_windows_virtual_machine" "windows_vms" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = (known after apply)
      + automatic_updates_enabled                              = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = (known after apply)
      + id                                                     = (known after apply)
      + location                                               = "centralindia"
      + max_bid_price                                          = -1
      + name                                                   = "vm-dev-web-01"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-dev-ci"
      + size                                                   = "Standard_D2s_v3"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2016-Datacenter"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.vnets.azurerm_virtual_network.vnet["vnet-dev-ci"] will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "centralindia"
      + name                           = "vnet-dev-ci"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-dev-ci"
      + subnet                         = [
          + {
              + address_prefixes                              = [
                  + "10.0.1.0/24",
                ]
              + default_outbound_access_enabled               = true
              + delegation                                    = []
              + id                                            = (known after apply)
              + name                                          = "snet-web"
              + private_endpoint_network_policies             = "Disabled"
              + private_link_service_network_policies_enabled = true
              + service_endpoint_policy_ids                   = []
              + service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
          + {
              + address_prefixes                              = [
                  + "10.0.2.0/24",
                ]
              + default_outbound_access_enabled               = true
              + delegation                                    = []
              + id                                            = (known after apply)
              + name                                          = "snet-app"
              + private_endpoint_network_policies             = "Disabled"
              + private_link_service_network_policies_enabled = true
              + service_endpoint_policy_ids                   = []
              + service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
        ]
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vm_ips = {
      + vm-dev-app-01 = (known after apply)
      + vm-dev-web-01 = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @sammy856, Action: `pull_request`, Working Directory: ``, Workflow: `Tearraform infra Create`*